
### :robot: Terraform Report
---
##### Plan: `40` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "shjhaiac-rg"
      + tags     = {
          + "siteId" = "shjhaiac"
        }
    }

  # module.base.module.aks-arc.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.aks-arc.azapi_resource.connectedCluster will be created
  + resource "azapi_resource" "connectedCluster" {
      + body                      = {
          + kind       = "ProvisionedCluster"
          + properties = {
              + aadProfile                = {
                  + adminGroupObjectIDs = [
                      + "2a429c24-2aed-455b-974e-6d6710da8f7e",
                    ]
                  + enableAzureRBAC     = true
                  + tenantID            = (known after apply)
                }
              + agentPublicKeyCertificate = ""
              + azureHybridBenefit        = null
              + distribution              = null
              + infrastructure            = null
              + privateLinkState          = null
              + provisioningState         = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-aksArc"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.Kubernetes/connectedClusters@2024-01-01"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.aks-arc.azapi_resource.provisionedClusterInstance will be created
  + resource "azapi_resource" "provisionedClusterInstance" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + agentPoolProfiles      = [
                  + {
                      + count             = 1
                      + enableAutoScaling = false
                      + osSKU             = "CBLMariner"
                      + osType            = "Linux"
                      + vmSize            = "Standard_A4_v2"
                    },
                ]
              + cloudProviderProfile   = {
                  + infraNetworkProfile = {
                      + vnetSubnetIds = [
                          + (known after apply),
                        ]
                    }
                }
              + clusterVMAccessProfile = {}
              + controlPlane           = {
                  + controlPlaneEndpoint = {
                      + hostIP = "192.168.1.190"
                    }
                  + count                = 1
                  + vmSize               = "Standard_A4_v2"
                }
              + kubernetesVersion      = "1.28.5"
              + licenseProfile         = {
                  + azureHybridBenefit = "False"
                }
              + linuxProfile           = {
                  + ssh = {
                      + publicKeys = [
                          + {
                              + keyData = (known after apply)
                            },
                        ]
                    }
                }
              + networkProfile         = {
                  + loadBalancerProfile = {}
                  + networkPolicy       = "calico"
                  + podCidr             = "10.244.0.0/16"
                }
              + storageProfile         = {
                  + nfsCsiDriver = {
                      + enabled = true
                    }
                  + smbCsiDriver = {
                      + enabled = true
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.HybridContainerService/provisionedClusterInstances@2024-01-01"
    }

  # module.base.module.aks-arc.azurerm_key_vault_secret.sshPrivateKeyPem[0] will be created
  + resource "azurerm_key_vault_secret" "sshPrivateKeyPem" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AksArcAgentSshPrivateKeyPem"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks-arc.azurerm_key_vault_secret.sshPublicKey[0] will be created
  + resource "azurerm_key_vault_secret" "sshPublicKey" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AksArcAgentSshPublicKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.aks-arc.terraform_data.replacement[0] will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "shjhaiac-rg"
      + output = (known after apply)
    }

  # module.base.module.aks-arc.terraform_data.waitAksVhdReady[0] will be created
  + resource "terraform_data" "waitAksVhdReady" {
      + id = (known after apply)
    }

  # module.base.module.aks-arc.tls_private_key.rsaKey[0] will be created
  + resource "tls_private_key" "rsaKey" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

  # module.base.module.hci.data.azapi_resource.arcSettings will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arcSettings" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "default"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.AzureStackHCI/clusters/ArcSettings@2023-08-01"
    }

  # module.base.module.hci.data.azapi_resource.arcbridge will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "arcbridge" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "shjhaiac-cl-arcbridge"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ResourceConnector/appliances@2022-10-27"
    }

  # module.base.module.hci.data.azapi_resource.customlocation will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource" "customlocation" {
      + id          = (known after apply)
      + identity    = (known after apply)
      + location    = (known after apply)
      + name        = "shjhaiac-customlocation"
      + output      = (known after apply)
      + parent_id   = (known after apply)
      + resource_id = (known after apply)
      + tags        = (known after apply)
      + type        = "Microsoft.ExtendedLocation/customLocations@2021-08-15"
    }

  # module.base.module.hci.data.azapi_resource_list.userStorages will be read during apply
  # (config refers to values not yet known)
 <= data "azapi_resource_list" "userStorages" {
      + id                     = (known after apply)
      + output                 = (known after apply)
      + parent_id              = (known after apply)
      + response_export_values = [
          + "*",
        ]
      + type                   = "Microsoft.AzureStackHCI/storagecontainers@2022-12-15-preview"
    }

  # module.base.module.hci.data.azurerm_arc_machine.arcservers["AzSHOST1"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "shjhaiac-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci.data.azurerm_arc_machine.arcservers["AzSHOST2"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "arcservers" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "shjhaiac-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci.azapi_resource.cluster will be created
  + resource "azapi_resource" "cluster" {
      + body                      = {
          + properties = {}
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-cl"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.AzureStackHCI/clusters@2023-08-01-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.hci.azapi_resource.validatedeploymentsetting_seperate[0] will be created
  + resource "azapi_resource" "validatedeploymentsetting_seperate" {
      + body                      = {
          + properties = {
              + arcNodeResourceIds      = [
                  + (known after apply),
                  + (known after apply),
                ]
              + deploymentConfiguration = {
                  + scaleUnits = [
                      + {
                          + deploymentData = {
                              + adouPath              = "OU=shjhaiac,DC=jumpstart,DC=local"
                              + cluster               = {
                                  + azureServiceEndpoint = "core.windows.net"
                                  + cloudAccountName     = (known after apply)
                                  + name                 = "shjhaiac-cl"
                                  + witnessPath          = "Cloud"
                                  + witnessType          = "Cloud"
                                }
                              + domainFqdn            = "jumpstart.local"
                              + hostNetwork           = {
                                  + enableStorageAutoIp           = true
                                  + intents                       = [
                                      + {
                                          + adapter                             = [
                                              + "FACBRIC",
                                              + "FABRIC2",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "ManagementCompute"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Management",
                                              + "Compute",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                      + {
                                          + adapter                             = [
                                              + "StorageA",
                                              + "StorageB",
                                            ]
                                          + adapterPropertyOverrides            = {
                                              + jumboPacket             = ""
                                              + networkDirect           = "Disabled"
                                              + networkDirectTechnology = ""
                                            }
                                          + name                                = "Storage"
                                          + overrideAdapterProperty             = true
                                          + overrideQosPolicy                   = false
                                          + overrideVirtualSwitchConfiguration  = false
                                          + qosPolicyOverrides                  = {
                                              + bandwidthPercentage_SMB         = ""
                                              + priorityValue8021Action_Cluster = ""
                                              + priorityValue8021Action_SMB     = ""
                                            }
                                          + trafficType                         = [
                                              + "Storage",
                                            ]
                                          + virtualSwitchConfigurationOverrides = {
                                              + enableIov              = ""
                                              + loadBalancingAlgorithm = ""
                                            }
                                        },
                                    ]
                                  + storageConnectivitySwitchless = false
                                  + storageNetworks               = [
                                      + {
                                          + name               = "Storage1Network"
                                          + networkAdapterName = "StorageA"
                                          + vlanId             = "711"
                                        },
                                      + {
                                          + name               = "Storage2Network"
                                          + networkAdapterName = "StorageB"
                                          + vlanId             = "712"
                                        },
                                    ]
                                }
                              + infrastructureNetwork = [
                                  + {
                                      + dnsServers = [
                                          + "192.168.1.254",
                                        ]
                                      + gateway    = "192.168.1.1"
                                      + ipPools    = [
                                          + {
                                              + endingAddress   = "192.168.1.65"
                                              + startingAddress = "192.168.1.55"
                                            },
                                        ]
                                      + subnetMask = "255.255.255.0"
                                      + useDhcp    = false
                                    },
                                ]
                              + namingPrefix          = "shjhaiac"
                              + observability         = {
                                  + episodicDataUpload  = true
                                  + euLocation          = false
                                  + streamingDataClient = true
                                }
                              + optionalServices      = {
                                  + customLocation = "shjhaiac-customlocation"
                                }
                              + physicalNodes         = [
                                  + {
                                      + ipv4Address = "192.168.1.12"
                                      + name        = "AzSHOST1"
                                    },
                                  + {
                                      + ipv4Address = "192.168.1.13"
                                      + name        = "AzSHOST2"
                                    },
                                ]
                              + secretsLocation       = (known after apply)
                              + securitySettings      = {
                                  + bitlockerBootVolume           = true
                                  + bitlockerDataVolumes          = true
                                  + credentialGuardEnforced       = true
                                  + driftControlEnforced          = true
                                  + drtmProtection                = true
                                  + hvciProtection                = true
                                  + sideChannelMitigationEnforced = true
                                  + smbClusterEncryption          = false
                                  + smbSigningEnforced            = true
                                  + wdacEnforced                  = true
                                }
                              + storage               = {
                                  + configurationMode = "Express"
                                }
                            }
                        },
                    ]
                  + version    = "10.0.0.0"
                }
              + deploymentMode          = "Validate"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2023-08-01-preview"
    }

  # module.base.module.hci.azapi_update_resource.deploymentsetting[0] will be created
  + resource "azapi_update_resource" "deploymentsetting" {
      + body                    = {
          + properties = {
              + deploymentMode = "Deploy"
            }
        }
      + id                      = (known after apply)
      + ignore_casing           = false
      + ignore_missing_property = true
      + name                    = "default"
      + output                  = (known after apply)
      + parent_id               = (known after apply)
      + resource_id             = (known after apply)
      + type                    = "Microsoft.AzureStackHCI/clusters/deploymentSettings@2023-08-01-preview"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

  # module.base.module.hci.azurerm_key_vault.DeploymentKeyVault will be created
  + resource "azurerm_key_vault" "DeploymentKeyVault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus2"
      + name                            = (known after apply)
      + public_network_access_enabled   = true
      + resource_group_name             = "shjhaiac-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 30
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.base.module.hci.azurerm_key_vault_secret.AzureStackLCMUserCredential will be created
  + resource "azurerm_key_vault_secret" "AzureStackLCMUserCredential" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AzureStackLCMUserCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci.azurerm_key_vault_secret.DefaultARBApplication will be created
  + resource "azurerm_key_vault_secret" "DefaultARBApplication" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "DefaultARBApplication"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci.azurerm_key_vault_secret.LocalAdminCredential will be created
  + resource "azurerm_key_vault_secret" "LocalAdminCredential" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "LocalAdminCredential"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci.azurerm_key_vault_secret.WitnessStorageKey will be created
  + resource "azurerm_key_vault_secret" "WitnessStorageKey" {
      + content_type            = "Secret"
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "WitnessStorageKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.base.module.hci.azurerm_role_assignment.ServicePrincipalRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "ServicePrincipalRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f0e0e122-3f80-44ed-95d2-f56e6fdc514c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.azurerm_storage_account.witness will be created
  + resource "azurerm_storage_account" "witness" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus2"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "shjhaiac-rg"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)
    }

  # module.base.module.hci.random_integer.random_suffix will be created
  + resource "random_integer" "random_suffix" {
      + id     = (known after apply)
      + max    = 99
      + min    = 10
      + result = (known after apply)
    }

  # module.base.module.hci-provisioners[0].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.base.module.hci-provisioners[0].terraform_data.ad_creation_provisioner will be created
  + resource "terraform_data" "ad_creation_provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci-provisioners[0].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "shjhaiac-rg"
      + output = (known after apply)
    }

  # module.base.module.logical-network.azapi_resource.logicalNetwork will be created
  + resource "azapi_resource" "logicalNetwork" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + dhcpOptions  = {
                  + dnsServers = [
                      + "192.168.1.254",
                    ]
                }
              + subnets      = [
                  + {
                      + name       = "default"
                      + properties = {
                          + addressPrefix      = "192.168.1.0/24"
                          + ipAllocationMethod = "Static"
                          + ipPools            = [
                              + {
                                  + end   = "192.168.1.190"
                                  + info  = {}
                                  + start = "192.168.1.171"
                                },
                            ]
                          + routeTable         = {
                              + properties = {
                                  + routes = [
                                      + {
                                          + name       = "default"
                                          + properties = {
                                              + addressPrefix    = "0.0.0.0/0"
                                              + nextHopIpAddress = "192.168.1.1"
                                            }
                                        },
                                    ]
                                }
                            }
                        }
                    },
                ]
              + vmSwitchName = "ConvergedSwitch(managementcompute)"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-logicalnetwork"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/logicalNetworks@2023-09-01-preview"
    }

  # module.base.module.site-manager.azapi_resource.address[0] will be created
  + resource "azapi_resource" "address" {
      + body                      = {
          + properties = {
              + addressClassification = "Site"
              + contactDetails        = {
                  + contactName    = " "
                  + emailList      = []
                  + mobile         = ""
                  + phone          = ""
                  + phoneExtension = ""
                }
              + shippingAddress       = {
                  + addressType     = "None"
                  + city            = ""
                  + companyName     = ""
                  + country         = "US"
                  + postalCode      = ""
                  + stateOrProvince = ""
                  + streetAddress1  = ""
                  + streetAddress2  = ""
                  + streetAddress3  = ""
                  + zipExtendedCode = ""
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-address"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.EdgeOrder/addresses@2024-02-01"
    }

  # module.base.module.site-manager.azapi_resource.site[0] will be created
  + resource "azapi_resource" "site" {
      + body                      = {
          + properties = {
              + addressResourceId = (known after apply)
              + displayName       = "shjhaiac"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "shjhaiac"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.Edge/Sites@2023-07-01-preview"
    }

  # module.base.module.vm[0].azapi_resource.hybrid_compute_machine will be created
  + resource "azapi_resource" "hybrid_compute_machine" {
      + body                      = {
          + kind = "HCI"
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-vm"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.HybridCompute/machines@2023-10-03-preview"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.base.module.vm[0].azapi_resource.nic will be created
  + resource "azapi_resource" "nic" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + ipConfigurations = [
                  + {
                      + name       = null
                      + properties = {
                          + privateIPAddress = null
                          + subnet           = {
                              + id = (known after apply)
                            }
                        }
                    },
                ]
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "shjhaiac-vm-nic"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/networkInterfaces@2023-09-01-preview"
    }

  # module.base.module.vm[0].azapi_resource.virtual_machine will be created
  + resource "azapi_resource" "virtual_machine" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + hardwareProfile = {
                  + dynamicMemoryConfig = {
                      + maximumMemoryMB    = 8192
                      + minimumMemoryMB    = 512
                      + targetMemoryBuffer = 20
                    }
                  + memoryMB            = 8192
                  + processors          = 2
                  + vmSize              = "Custom"
                }
              + networkProfile  = {
                  + networkInterfaces = [
                      + {
                          + id = (known after apply)
                        },
                    ]
                }
              + osProfile       = {
                  + adminPassword        = (sensitive value)
                  + adminUsername        = "shjhaiacadmin"
                  + computerName         = "shjhaiac-vm"
                  + windowsConfiguration = {
                      + provisionVMAgent       = true
                      + provisionVMConfigAgent = true
                    }
                }
              + storageProfile  = {
                  + dataDisks             = []
                  + imageReference        = {
                      + id = (known after apply)
                    }
                  + vmConfigStoragePathId = null
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = (known after apply)
      + name                      = "default"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/virtualMachineInstances@2023-09-01-preview"

      + timeouts {
          + create = "2h"
        }
    }

  # module.base.module.vm-image.azapi_resource.winServerImage[0] will be created
  + resource "azapi_resource" "winServerImage" {
      + body                      = {
          + extendedLocation = {
              + name = (known after apply)
              + type = "CustomLocation"
            }
          + properties       = {
              + containerId      = null
              + hyperVGeneration = "V2"
              + identifier       = {
                  + offer     = "WindowsServer"
                  + publisher = "MicrosoftWindowsServer"
                  + sku       = "2022-datacenter-azure-edition"
                }
              + osType           = "Windows"
              + version          = {
                  + name       = "20348.2113.231109"
                  + properties = {
                      + storageProfile = {
                          + osDiskImage = {}
                        }
                    }
                }
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "eastus2"
      + name                      = "winServer2022-01"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = (known after apply)
      + type                      = "Microsoft.AzureStackHCI/marketplaceGalleryImages@2023-09-01-preview"

      + timeouts {
          + create = "24h"
          + delete = "60m"
        }
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST1"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST1"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "shjhaiac-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["KVSU"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST1"].azurerm_role_assignment.MachineRoleAssign["Reader"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST2"].data.azurerm_arc_machine.server will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_arc_machine" "server" {
      + active_directory_fqdn          = (known after apply)
      + agent                          = (known after apply)
      + agent_version                  = (known after apply)
      + client_public_key              = (known after apply)
      + cloud_metadata                 = (known after apply)
      + detected_properties            = (known after apply)
      + display_name                   = (known after apply)
      + dns_fqdn                       = (known after apply)
      + domain_name                    = (known after apply)
      + id                             = (known after apply)
      + identity                       = (known after apply)
      + last_status_change_time        = (known after apply)
      + location                       = (known after apply)
      + location_data                  = (known after apply)
      + machine_fqdn                   = (known after apply)
      + mssql_discovered               = (known after apply)
      + name                           = "AzSHOST2"
      + os_name                        = (known after apply)
      + os_profile                     = (known after apply)
      + os_sku                         = (known after apply)
      + os_type                        = (known after apply)
      + os_version                     = (known after apply)
      + parent_cluster_resource_id     = (known after apply)
      + private_link_scope_resource_id = (known after apply)
      + resource_group_name            = "shjhaiac-rg"
      + service_status                 = (known after apply)
      + status                         = (known after apply)
      + tags                           = (known after apply)
      + vm_id                          = (known after apply)
      + vm_uuid                        = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["ACMRM"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Connected Machine Resource Manager"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["ASHDMR"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Stack HCI Device Management Role"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["KVSU"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci.module.serverRoleBindings["AzSHOST2"].azurerm_role_assignment.MachineRoleAssign["Reader"] will be created
  + resource "azurerm_role_assignment" "MachineRoleAssign" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/cff3e2b4-e15d-4d1d-9345-e807c566dc1c/resourceGroups/shjhaiac-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.base.module.hci-provisioners[0].module.servers["AzSHOST1"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci-provisioners[0].module.servers["AzSHOST1"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "shjhaiac-rg"
      + output = (known after apply)
    }

  # module.base.module.hci-provisioners[0].module.servers["AzSHOST2"].terraform_data.provisioner will be created
  + resource "terraform_data" "provisioner" {
      + id = (known after apply)
    }

  # module.base.module.hci-provisioners[0].module.servers["AzSHOST2"].terraform_data.replacement will be created
  + resource "terraform_data" "replacement" {
      + id     = (known after apply)
      + input  = "shjhaiac-rg"
      + output = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11286772462`](https://github.com/2sjha/arciac/actions/runs/11286772462) - commit e452c747ff9f48ae3990f295054b1bbd34f7093b
